src/cf/InformationRegisters/НастройкиДополнительныхРеквизитовЭПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиДополнительныхРеквизитовЭПД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Квалификаторы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Перечисления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>180</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторИнформации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтрагентБЭД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиДополнительныхРеквизитовЭПД/Forms/ФормаВыбораГруппыДанных/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ТипДокумента", ТипДокумента);
	
	ДеревоЗначений = ОбменСГИСЭПД.ДеревоГруппДанныхДляДополнительныхПолей(ТипДокумента);
	
	ЗначениеВРеквизитФормы(ДеревоЗначений, "Дерево");
	
	ТекущаяГруппа = Неопределено;
	Параметры.Свойство("ГруппаДанных", ТекущаяГруппа);
	
	Если ТекущаяГруппа <> Неопределено Тогда
		СтрокаДерева = НайтиСтрокуДереваРекурсивно(Дерево, "Путь", ТекущаяГруппа);
		Если СтрокаДерева <> Неопределено Тогда
			Элементы.Дерево.ТекущаяСтрока = СтрокаДерева.ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТехническиеПоля(Команда)
	
	Элементы.ДеревоПуть.Видимость = Не Элементы.ДеревоПуть.Видимость;
	Элементы.ДеревоУзел.Видимость = Не Элементы.ДеревоУзел.Видимость;
	
	Элементы.ДеревоПоказатьТехническиеПоля.Заголовок = ?(Элементы.ДеревоПуть.Видимость, 
		НСтр("ru='Скрыть технические поля'"), 
		НСтр("ru='Показать технические поля'"));
		
КонецПроцедуры


&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыбраннаяСтрока = Элементы.Дерево.ВыделенныеСтроки.Получить(0);
	
	ТекущиеДанные = Дерево.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Результат = Новый Структура;
	Результат.Вставить("ГруппаДанных", ТекущиеДанные.Путь);
	Результат.Вставить("Узел", ТекущиеДанные.Узел);
	
	Закрыть(Результат);
	
КонецПроцедуры


&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Дерево.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Результат = Новый Структура;
	Результат.Вставить("ГруппаДанных", ТекущиеДанные.Путь);
	Результат.Вставить("Узел", ТекущиеДанные.Узел);
	
	Закрыть(Результат);

КонецПроцедуры

&НаСервере
Функция НайтиСтрокуДереваРекурсивно(ДеревоРодитель, ИмяПоля, Значение)
	
	Для Каждого СтрокаДерева Из ДеревоРодитель.ПолучитьЭлементы() Цикл
		Если СтрокаДерева[ИмяПоля] = Значение Тогда
			Возврат СтрокаДерева;	
		Иначе
			НайденнаяСтрока = НайтиСтрокуДереваРекурсивно(СтрокаДерева, ИмяПоля, Значение);
			Если НайденнаяСтрока <> Неопределено Тогда
				Возврат НайденнаяСтрока;
			КонецЕсли;		
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции
